swiftwasm/WasmKit/Examples/embedded-esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
# WasmKit's interpreter needs a much deeper stack than the default 3.5 KB.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=65536
# WasmKit is a large binary; use the single large app partition layout.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
